Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13F.tmx
Source language: en_us
Languages: zh_cn

source: Smoky chicken with warm corn & potato salad
zh_cn: 烟熏鸡胸肉配玉米土豆沙拉

source: This chicken dish is full of fresh summer flavours, perfect for a quick and healthy midweek meal
zh_cn: 道鸡肉饱含着初夏的味道，简易、健康、完美，非常适合在平日里享用。

source: Ingredients
zh_cn: 食材：

source: Serves 4
zh_cn: 四人份

source: 2 lb bag new potatoes
zh_cn: 2磅袋装的小土豆

source: 2 large corn cobs
zh_cn: 2根玉米棒

source: 1/2 red onion , thinly sliced
zh_cn: 1/2颗红洋葱，切细丝

source: juice 1 lime
zh_cn: 1个柠檬，取汁

source: 2 tbsp olive oil
zh_cn: 2汤匙橄榄油

source: 2 garlic cloves , crushed
zh_cn: 2个大蒜瓣，碾成泥

source: 1/2- 1 tsp sweet smoked paprika
zh_cn: 1汤匙烟熏辣椒粉

source: 4 skinless chicken breasts , each halved across the middle to make 2 thin escalopes
zh_cn: 4块无皮鸡胸肉，对半切成两小块

source: small bunch coriander , leaves roughly chopped
zh_cn: 1小把香菜叶

source: lime wedges, optional, to serve
zh_cn: 酸橙可选

source: Method
zh_cn: 制作方法：

source: Bring to the boil a saucepan of water big enough to hold all the potatoes and corn. Cook the potatoes for 12 mins, adding the corn after 6 mins, until both are tender. Drain well.
zh_cn: 1.烧一锅沸水，先放入土豆煮12分钟，再放入玉米煮6分钟至变软，然后盛出来沥干。

source: Meanwhile, mix the sliced red onion with the lime juice and half the oil in a large salad bowl.
zh_cn: 2.同时，将洋葱丝、柠檬汁和1勺橄榄油放进沙拉碗混合。

source: Mix the remaining oil with the garlic, paprika and some seasoning in a shallow bowl, then toss in the chicken until thoroughly coated.
zh_cn: 再将剩下的橄榄油同大蒜泥、辣椒粉和一些调味品倒进小碗混合，浇在鸡胸肉上彻底得抹匀。

source: Heat a griddle pan, then griddle the chicken for 3 mins on each side until cooked through.
zh_cn: 3.起煎锅，将鸡胸肉每面煎3分钟至熟透。

source: Tip the potatoes into the bowl with the onions. Stand a corn cob on one end on a chopping board, then slice down the length, cutting off the kernels in strips.
zh_cn: 玉米切成小块，同土豆和香菜碎一起倒入沙拉碗中调和均匀。

source: Mix into the potato salad with the coriander and seasoning, then serve alongside the smoky griddled chicken, with lime wedges, if using.
zh_cn: 最后将沙拉同鸡肉一道上桌，也可以根据口味加些酸橙调味。

source: Nutrition per serving
zh_cn: 营养价值：

source: 343 kcalories, protein 38.0g, carbohydrate 31.0g, fat 8.0g, saturated fat 1.0g, fibre 2.0g, salt 0.25g.
zh_cn: 卡路里：343千卡，蛋白质：38.0克，碳水化合物：31.0克，脂肪：8.0克，饱和脂肪：1.0克，纤维素：2.0克，盐：0.25克
